app/controllers/order_items_controller.rb

  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save
---
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "unit_price", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 3], ["product_id", 3], ["order_id", 1], ["unit_price", 0.29], ["total_price", 0.87], ["created_at", "2015-12-06 02:33:30.796000"], ["updated_at", "2015-12-06 02:33:30.796000"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at", "order_status_id") VALUES (?, ?, ?, ?)  [["subtotal", 0.87], ["created_at", "2015-12-06 02:33:30.793206"], ["updated_at", "2015-12-06 02:33:30.793206"], ["order_status_id", 1]]